Revit 2025 API
ExporterIFC.AddBuildingStorey Method
 Adds building storey to the exporter's internal cache.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public void AddBuildingStorey(
	ElementId id,
	IFCLevelInfo levelInfo
)
Public Sub AddBuildingStorey (
	id As ElementId,
	levelInfo As IFCLevelInfo
)
public:
void AddBuildingStorey(
	ElementId^ id,
	IFCLevelInfo^ levelInfo
)
member AddBuildingStorey :
        id : ElementId *
        levelInfo : IFCLevelInfo -> unit
Parameters
id ElementId
 The level id.
levelInfo IFCLevelInfo
 The IFCLevelInfo object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace